/*----------------------------------
  03_変数　宿題
----------------------------------

問題① プログラムを書こう!!
  ・「weather」という名前の定数を作り
  ・「晴れ」というデータを入れて
  ・出力する

----------------------------------

問題② プログラムを書こう!!
  ・「box」という名前の変数を宣言だけする
  ・「1」という値を入れる
  ・出力する
  ・「猫」という値を入れる
  ・出力する

----------------------------------

問題③ 下のプログラムは動くかな…？理由はなんだろう？

void main() {
  // これは実際に動かさないで考えてみよう!
  final number = 1;
  number = 2;
  print(number);
}

----------------------------------*/

void main() {
  // 問題①のプログラムを書いてね

  // 問題②のプログラムを書いてね

  // 問題③は動かさないで考えてみよう〜!
}
