/*----------------------------------
  01_出力をしよう！
----------------------------------

①基本形とコメントアウト

void main() {

}


コメントアウト（その部分の記述を無効にする）
・Windows：Ctrl + /
・Mac：Cmd + /

----------------------------------

②文字の出力

【コード】
void main() {
  print('Hello World!'); ⇦ここに書き足そう
}

【出力結果】
Hello World!


＊ポイント＊
・計算しない（文字など）は'(シングルクォーテーション)で囲う
・空白、改行、記号（;セミコロン など）は見本に合わせる

----------------------------------

③数字の出力・計算

【コード】
void main() {
  print(1+2); ⇦ここだけ書き換えよう
}

【出力結果】
3

＊ポイント＊
・+ ⇨ 足し算。例：1+2 >> 3
・- ⇨ 引き算。例：3-1 >> 2
・* ⇨ 掛け算。例：3*2 >> 6
・/ ⇨ 割り算 小数点アリ。例：3/2 >> 1.5
・~/  ⇨ 割り算 小数点切り捨て。例：3~/2 >> 1
・% ⇨ 割り算をしたあまり。例：5%3 >> 2


----------------------------------
  実際に書いてみよう！
----------------------------------*/

void main() {
  // ここに書いてみよう
}
